# Activité : SGBD - SQL

Le langage SQL (Structured Query Language) est principalement utilisé par les SGBD et les bases de données relationnelles.

Les commandes SQL exécutées ci-après vont :
- créer les tables de la base de données libres.db
- insérer des données dans les tables
- interroger les données des tables
- ajouter et modifier des données de certaines tables

Pour effectuer ces commandes, on utilise des CLAUSE sql : SELECT, WHERE ,DISTINCT, ORDER BY, INSERT INTO, UPDATE.

In [1]:
# Chargement de la librairie sql
%load_ext sql

In [2]:
# ouverture de la base de données livres.db ; si elle n'existe pas, elle sera créée.
%sql sqlite:///livres.db

## Création des tables

La commande précédente crée une base de données mais elle est vide.

On crée les 5 relations en respectant le schéma relationnel réalisé en activité.
On met en place les contraintes d'intégrité:
- les clefs primaires pour chaque table sont initialisées avec la clause PRIMARY KEY
- les clefs étrangères sont initialisées avec la clause REFERENCES suivi de la clef primaire utilisée.
- la table de jointure entre les tables livre et theme.

In [3]:
%%sql 
CREATE TABLE IF NOT EXISTS 'livre' (
    id_livre INT PRIMARY KEY,
    titre VARCHAR(90) NOT NULL,
    ann_pub INT,
    id_auteur INT REFERENCES auteur (id_auteur),
    id_langue INT REFERENCES langue (id_langue)
);

CREATE TABLE IF NOT EXISTS 'auteur'(
    id_auteur INT PRIMARY KEY,
    nom VARCHAR(40) NOT NULL,
    prenom  VARCHAR(40) NOT NULL,
    ann_naiss INT NOT NULL
);

CREATE TABLE IF NOT EXISTS 'genre'(
    id_genre INT PRIMARY KEY,
    theme VARCHAR(40) NOT NULL
);

CREATE TABLE IF NOT EXISTS 'langue'(
    id_langue INT PRIMARY KEY,
    langue VARCHAR(30) NOT NULL
);

CREATE TABLE IF NOT EXISTS 'livre_par_genre' (
    id_livre INT REFERENCES livre (id_livre),
    id_genre INT REFERENCES genre (id_genre),
    PRIMARY KEY (id_livre,id_genre)
);

 * sqlite:///livres.db
Done.
Done.
Done.
Done.
Done.

[]

## Insertion de données

Les 5 relations sont vides. Il faut les compléter avec les valeurs du tableau vu en activité.

In [4]:
%%sql 
INSERT INTO 'livre' VALUES
(1,'1984',1949,1,1),
(2,'Dune',1965,2,1),
(3,'Fondation',1951,3,1),
(4,'Le meilleur des mondes',1931,4,1),
(5,'Farenheit',1953,5,1),
(6,'Ubik',1969,6,1),
(7,'Chroniques martiennes',1950,5,1),
(8,'La nuit des temps',1968,7,1),
(9,'Blade runner',1968,6,1),
(10,'Les robots',1950,3,1),
(11,'La planète des singes',1963,8,2),
(12,'Ravage',1943,7,1),
(13,'Le maitre du haut chateau',1962,6,1),
(14,'Le monde des A',1945,9,1),
(15,"La fin de l'éternité",1955,3,1),
(16,'De la terre à la lune',1865,10,2);

INSERT INTO 'auteur' VALUES
(1,'Orwell','George',1903),
(2,'Herbert','Franck',1920),
(3,'Asimov','Isaac',1920),
(4,'Huxley','Aldous',1894),
(5,'Bradbury','Ray',1920),
(6,'K.Dick','Philip',1928),
(7,'Barjavel','René',1911),
(8,'Boulle','Pierre',1912),
(9,'Van Vogt','Alfred Eton',1912),
(10,'Verne','Jules',1828);

INSERT INTO 'genre' VALUES
(1,'totalitarisme'),
(2,'science fiction'),
(3,'anticipation'),
(4,'dystopie'),
(5,'économie'),
(6,'tragédie'),
(7,'intelligence artificielle'),
(8,'uchronie'),
(9,'voyage dans le temps'),
(10,'aventure');

INSERT INTO 'langue' VALUES
(1,'anglais'),
(2,'français'),
(3,'allemand');

INSERT INTO 'livre_par_genre' VALUES
(1,1),(1,2),(1,3),(1,4),
(2,2),(2,3),
(3,2),(3,5),
(4,1),(4,2),(4,4),
(5,2),(5,4),
(6,2),(6,3),
(7,2),(7,3),
(8,2),(8,6),
(9,7),(9,2),
(10,2),(10,7),
(11,2),(11,4),
(12,2),(12,3),
(13,4),(13,8),
(14,2),(14,7),
(15,2),(15,9),
(16,2),(16,10);

 * sqlite:///livres.db
16 rows affected.
10 rows affected.
10 rows affected.
3 rows affected.
35 rows affected.

[]

In [5]:
%sql SELECT * from auteur;

 * sqlite:///livres.db
Done.

[(1, 'Orwell', 'George', 1903),
 (2, 'Herbert', 'Franck', 1920),
 (3, 'Asimov', 'Isaac', 1920),
 (4, 'Huxley', 'Aldous', 1894),
 (5, 'Bradbury', 'Ray', 1920),
 (6, 'K.Dick', 'Philip', 1928),
 (7, 'Barjavel', 'René', 1911),
 (8, 'Boulle', 'Pierre', 1912),
 (9, 'Van Vogt', 'Alfred Eton', 1912),
 (10, 'Verne', 'Jules', 1828)]

In [7]:
# Afficher les nom et prénom des auteurs nés en 1920

#%sql SELECT nom,ann_naiss FROM 'auteur' ORDER BY ann_naiss DESC;

%sql SELECT nom,ann_naiss FROM 'auteur' ORDER BY ann_naiss DESC, nom ASC;

#%sql SELECT nom,prenom FROM 'auteur' WHERE ann_naiss = 1920;

#%sql SELECT nom,prenom FROM 'auteur' WHERE ann_naiss BETWEEN 1900 AND 2000;

#%sql SELECT titre,ann_pub FROM 'livre' WHERE titre LIKE 'La%';

#%sql SELECT nom,prenom FROM 'auteur' WHERE nom IN ('Asimov','Orwell');

#%sql SELECT titre FROM 'livre' WHERE ann_pub>1960 AND ann_pub<1980;

#%sql SELECT * FROM 'auteur';

 * sqlite:///livres.db
Done.

[('K.Dick', 1928),
 ('Asimov', 1920),
 ('Bradbury', 1920),
 ('Herbert', 1920),
 ('Boulle', 1912),
 ('Van Vogt', 1912),
 ('Barjavel', 1911),
 ('Orwell', 1903),
 ('Huxley', 1894),
 ('Verne', 1828)]

In [8]:
# Afficher les titres de livres du plus ancien au plus récent

%sql SELECT titre,ann_pub FROM 'livre' ORDER BY ann_pub;

 * sqlite:///livres.db
Done.

[('De la terre à la lune', 1865),
 ('Le meilleur des mondes', 1931),
 ('Ravage', 1943),
 ('Le monde des A', 1945),
 ('1984', 1949),
 ('Chroniques martiennes', 1950),
 ('Les robots', 1950),
 ('Fondation', 1951),
 ('Farenheit', 1953),
 ("La fin de l'éternité", 1955),
 ('Le maitre du haut chateau', 1962),
 ('La planète des singes', 1963),
 ('Dune', 1965),
 ('La nuit des temps', 1968),
 ('Blade runner', 1968),
 ('Ubik', 1969)]

In [9]:
%%sql 

SELECT titre,nom,prenom FROM 'livre'
JOIN 'auteur' ON livre.id_auteur = auteur.id_auteur
JOIN 'langue' ON livre.id_langue = langue.id_langue
WHERE langue = 'français';

 * sqlite:///livres.db
Done.

[('La planète des singes', 'Boulle', 'Pierre'),
 ('De la terre à la lune', 'Verne', 'Jules')]

In [10]:
%%sql

SELECT DISTINCT titre,theme FROM livre 
JOIN livre_par_genre ON livre.id_livre = livre_par_genre.id_livre
JOIN genre ON genre.id_genre=livre_par_genre.id_genre
WHERE theme = 'totalitarisme';

 * sqlite:///livres.db
Done.

[('1984', 'totalitarisme'), ('Le meilleur des mondes', 'totalitarisme')]

In [ ]:
# Afficher les titres des livres qui traitent de la science fiction
%sql SELECT titre FROM 'livre' \
JOIN 'livre_theme' ON livre_id=id_livre \
JOIN 'theme' ON theme_id=id_theme \
WHERE theme='science fiction';

In [ ]:
# Afficher les titre et auteur des livres qui ont écrit un roman d'aventure

%sql SELECT titre,nom FROM 'livre' \
JOIN 'auteur' ON auteur_id=id_auteur \
JOIN 'livre_theme' ON livre_id=id_livre \
JOIN 'theme' ON theme_id=id_theme \
WHERE theme='aventure';

In [ ]:
# Affiche le nombre d'élément contenus dans la table livre

%sql SELECT COUNT(*) FROM 'livre';

In [ ]:
# Insertion de 2 nouveaux livres
# Pour le second, on attribue un mauvais auteur que l'on va changer après

%sql INSERT INTO 'livre' VALUES (17,'Vingt mille lieues sous les mers',1870,10);

%sql INSERT INTO 'livre' VALUES (18,'Dôme',2009,10) ;

In [ ]:
# On vérifie que l'ajout s'est bien passé
%sql SELECT * FROM livre;

In [ ]:
# On ajoute l'auteur Stephen King manquant

%sql INSERT INTO 'auteur' VALUES (11,'King','Stephen',1947,1);

# On met à jouir la table livre en modifiant l'auteur_id avec l'id_auteur de Stephen King

%sql UPDATE 'livre' SET auteur_id=11 WHERE titre='Dôme';

In [ ]:
# On vérifie que tout est correct

%sql SELECT * FROM livre;

In [ ]:
%sql DELETE FROM 'livre' WHERE id_livre=17;

%sql DELETE FROM 'livre' WHERE id_livre=18;

### Table de jointure

Pour chaque titre de roman, on peut associer plusieurs thèmes. Ces thèmes peuvent être attribués à plusieurs romans. On parle alors de liaisons de plusieurs à plusieurs.

On crée une table de jointure **livre_theme** qui va contenir les clés primaires des tables **livre** et **theme**. Chaque couple est unique et constitue la clé primaire de notre table de jointure.

Une requête sur ces trois tables se fait par la clause JOIN ON. L'idée est de construire un tableau plus grand composé des attributs de chacune des tables. Le lien se faisant par les clefs étrangères.

In [ ]:
%%sql
SELECT * FROM livre_theme
JOIN livre ON livre.id_livre=livre_theme.livre_id
JOIN theme ON theme.id_theme=livre_theme.theme_id
WHERE livre.id_livre=1;

In [ ]:
%%sql
SELECT * FROM livre
JOIN livre_theme ON livre.id_livre=livre_theme.livre_id
JOIN theme ON theme.id_theme=livre_theme.theme_id
WHERE livre.id_livre=1;

In [ ]:
%%sql
SELECT * FROM theme
JOIN livre_theme ON theme.id_theme=livre_theme.theme_id
JOIN livre ON livre.id_livre=livre_theme.livre_id
WHERE livre.id_livre=1;

In [ ]:
%%sql
SELECT titre,ann_pub,livre_id,theme_id,theme FROM livre
JOIN livre_theme ON livre.id_livre=livre_theme.livre_id
JOIN theme ON theme.id_theme=livre_theme.theme_id;

In [ ]:
%%sql
SELECT titre,ann_pub,livre_id,theme_id,theme FROM livre
JOIN livre_theme ON id_livre=livre_id
JOIN theme ON id_theme=theme_id;